// game: 语句 10 (VariableDeclaration)
// 自动生成: tools/split-game.mjs
// 来源: game_main.deobf.js
// 说明: 本文件是 bundle 片段, 由 build/assemble-game.mjs 按 manifest 拼接;请勿手改拼接顺序。

  const v_y0_27725 = 0,
    v_S0_27726 = {},
    v_A0_27727 = (v_S0_27726[v_fe_27716] = 2, v_S0_27726[v_w0_27717] = 3, v_S0_27726[v__e_27718] = 4, v_S0_27726[v_he_27719] = v_y0_27725, v_S0_27726[0] = v_y0_27725, {}),
    v_de_27728 = (v_A0_27727[2] = [.8, 167 / 255, 0], v_A0_27727[3] = [228 / 255, 122 / 255, 0], v_A0_27727[4] = [32 / 255, 189 / 255, 27 / 255], 1920),
    v_x0_27729 = 1024,
    v_C0_27730 = 1158,
    v_ve_27731 = 5120,
    v_T0_27732 = 200;