// game: 语句 15 (VariableDeclaration)
// 自动生成: tools/split-game.mjs
// 来源: game_main.deobf.js
// 说明: 本文件是 bundle 片段, 由 build/assemble-game.mjs 按 manifest 拼接;请勿手改拼接顺序。

  let v_$_27766 = {},
    v_Q_27767 = (v_$_27766[v_Wt_27759] = 2001, v_$_27766[v_Kt_27760] = 2002, v_$_27766[v_Yt_27761] = 2003, v_$_27766[v_qt_27762] = 2004, v_$_27766[v_Zt_27763] = v_Z_27765, v_$_27766[1006] = v_Z_27765, v_$_27766[1007] = v_Z_27765, v_$_27766[1008] = v_Z_27765, v_$_27766[1009] = v_Z_27765, v_$_27766[v_$t_27764] = v_Z_27765, {});