// game: 语句 151 (FunctionDeclaration)
// 自动生成: tools/split-game.mjs
// 来源: game_main.deobf.js
// 说明: 本文件是 bundle 片段, 由 build/assemble-game.mjs 按 manifest 拼接;请勿手改拼接顺序。

  function v_Na_28070(v_s_34100) {
    if (v_s_34100) {
      let v_i_34101 = 250,
        v_e_34102 = 0,
        v_n_34103 = 0,
        v_r_34104;
      for (let v_t_34105 = 0; v_t_34105 < v_s_34100.byteLength; ++v_t_34105) v_r_34104 = v_n_34103, v_n_34103 = v_s_34100[v_t_34105], v_t_34105 % 5 == 0 ? v_s_34100[v_t_34105] ^= 105 : v_t_34105 % 19 == 0 ? v_s_34100[v_t_34105] ^= 209 : v_t_34105 % 83 == 0 ? v_s_34100[v_t_34105] ^= 72 : v_t_34105 % 97 == 0 ? v_s_34100[v_t_34105] ^= 2 : v_s_34100[v_t_34105] ^= v_i_34101, v_s_34100[v_t_34105] ^= 117 & v_r_34104 | 72 & v_e_34102, (v_i_34101 -= v_t_34105 % 3) < 0 && (v_i_34101 = 255), v_e_34102 = v_s_34100[v_t_34105];
    }
  }