// game: 语句 176 (FunctionDeclaration)
// 自动生成: tools/split-game.mjs
// 来源: game_main.deobf.js
// 说明: 本文件是 bundle 片段, 由 build/assemble-game.mjs 按 manifest 拼接;请勿手改拼接顺序。

  function v_ro_28094(v_t_34293, v_i_34294, v_e_34295, v_n_34296, v_r_34297, v_s_34298, v_a_34299, v_o_34300) {
    return v_i_34294 = v_t_34293 = [v_t_34293, v_i_34294, 1], [(v_t_34293 = [(v_e_34295 = [v_a_34299, -v_o_34300, v_e_34295 - v_e_34295 * v_a_34299 + v_n_34296 * v_o_34300, v_o_34300, v_a_34299, v_n_34296 - v_e_34295 * v_o_34300 - v_n_34296 * v_a_34299, 0, 0, 1])[0] * v_i_34294[0] + v_e_34295[1] * v_i_34294[1] + v_e_34295[2] * v_i_34294[2], v_e_34295[3] * v_i_34294[0] + v_e_34295[4] * v_i_34294[1] + v_e_34295[5] * v_i_34294[2], v_e_34295[6] * v_i_34294[0] + v_e_34295[7] * v_i_34294[1] + v_e_34295[8] * v_i_34294[2]])[0] + v_r_34297, v_t_34293[1] + v_s_34298];
  }