// game: 语句 266 (FunctionDeclaration)
// 自动生成: tools/split-game.mjs
// 来源: game_main.deobf.js
// 说明: 本文件是 bundle 片段, 由 build/assemble-game.mjs 按 manifest 拼接;请勿手改拼接顺序。

  function v_ac_28206(v_t_35246) {
    var v_i_35247 = v_t_35246[0] / 255,
      v_e_35248 = v_t_35246[1] / 255,
      v_t_35246 = v_t_35246[2] / 255,
      v_n_35249 = v_pe_27823(v_i_35247, v_e_35248, v_t_35246),
      v_r_35250 = v_me_27822(v_i_35247, v_e_35248, v_t_35246),
      v_s_35251 = v_n_35249 - v_r_35250;
    let v_a_35252 = 0;
    return v_r_35250 == v_n_35249 ? v_a_35252 = 0 : v_r_35250 == v_i_35247 ? v_a_35252 = (v_t_35246 - v_e_35248) / v_s_35251 * 60 + 180 : v_r_35250 == v_e_35248 ? v_a_35252 = (v_i_35247 - v_t_35246) / v_s_35251 * 60 + 300 : v_r_35250 == v_t_35246 && (v_a_35252 = (v_e_35248 - v_i_35247) / v_s_35251 * 60 + 60), [v_a_35252, v_s_35251 / (1 - v_s1_27830(v_n_35249 + v_r_35250 - 1)), (v_n_35249 + v_r_35250) / 2];
  }